In [1]:
import pandas as pd
import seaborn as srn
import statistics as sts

In [6]:
dataset = pd.read_csv("Churn.csv",sep =';')
# Nomeando aas coluns
dataset.columns =['Id','Score','Estado','Genero','Idade','Patrimonio','Saldo','Produtos','TemCartCredito','Ativo','Salario','Saiu']
dataset

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
0,1,619,RS,Feminino,42,2,0,1,1,1,10134888.0,1
1,2,608,SC,Feminino,41,1,8380786,1,0,1,11254258.0,0
2,3,502,RS,Feminino,42,8,1596608,3,1,0,11393157.0,1
3,4,699,RS,Feminino,39,1,0,2,0,0,9382663.0,0
4,5,850,SC,Feminino,43,2,12551082,1,1,1,790841.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
994,996,838,SC,Masculino,43,9,12310588,2,1,0,14576583.0,0
995,997,610,SC,Masculino,29,9,0,3,0,1,8391224.0,0
996,998,811,SC,Masculino,44,3,0,2,0,1,7843973.0,0
997,999,587,SC,Masculino,62,7,12128627,1,0,1,677692.0,0
998,1000,811,PR,Feminino,28,4,16773882,2,1,1,990342.0,0

In [ ]:
# tirando os Vazios de salário e substituindo pela mediana
#calcula a mediana
mediana = sts.median(dataset['Salario'])
mediana

#substitui vazios pelo valor de mediana
dataset ['Salario'].fillna(mediana, inplace = True)

#Verificando se ainda tem algum campo vazio
dataset['Salario'].isnull().sum()

C:\Users\ingri\AppData\Local\Temp\ipykernel_14760\3977611048.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset ['Salario'].fillna(mediana, inplace = True)

0

In [ ]:
# Padronizando Genero e Limpando valores vazios

#agrupando por genero para ver os valores
group_genero=dataset.groupby(['Genero']).size()
group_genero

Genero
F              2
Fem            1
Feminino     461
M              6
Masculino    529
dtype: int64

In [ ]:
#somando as NA's
dataset['Genero'].isnull().sum()

In [22]:
#Preenchendo os registros vazios com a moda
dataset['Genero'].fillna('Masculino', inplace =True)
dataset['Genero'].isnull().sum()

#Padronizando os Registros
dataset.loc[dataset['Genero']=='M','Genero']='Masculino'
dataset.loc[dataset['Genero'].isin(['Fem','F']), 'Genero']= 'Feminino'

group_genero=dataset.groupby(['Genero']).size()
group_genero

C:\Users\ingri\AppData\Local\Temp\ipykernel_14760\2042117500.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset['Genero'].fillna('Masculino', inplace =True)

Genero
Feminino     464
Masculino    535
dtype: int64

In [ ]:
# Idade fora do dominio
dataset['Idade'].describe()
# nessa coluna temos campos de idade que nao fazem sentido, numeros menores que zero e numeros como 140

count    999.000000
mean      38.902903
std       11.401912
min      -20.000000
25%       32.000000
50%       37.000000
75%       44.000000
max      140.000000
Name: Idade, dtype: float64

In [ ]:
# Analisando o tamanho do Problema
dataset.loc[(dataset['Idade']< 0) |(dataset['Idade'] > 120) ]

,Id,Score,Estado,Genero,Idade,Patrimonio,Saldo,Produtos,TemCartCredito,Ativo,Salario,Saiu
867,869,636,RS,Feminino,-10,1,17083346,1,1,0,11051028.0,1
984,986,773,RS,Masculino,-20,1,12453278,2,0,1,1172357.0,0
990,992,655,RS,Masculino,140,5,93147,2,1,0,6621413.0,0

In [25]:
# Calculando a mediana
mediana =sts.median(dataset['Idade'])
mediana

37

In [26]:
dataset.loc[(dataset['Idade']< 0) |(dataset['Idade'] > 120), 'Idade'] = mediana